#Користувач вводить змiннi "x" та "y" з довiльними цифровими значеннями;
#-  Створiть просту умовну конструкцiю(звiсно вона повинна бути в тiлi ф-цiї), 
#пiд час виконання якої буде перевiрятися рiвнiсть змiнних "x" та "y" 
#при нерiвностi змiнних "х" та "у" вiдповiдь повертали рiзницю чисел.
#-  Повиннi опрацювати такi умови:
#-  x > y;       вiдповiдь - х бiльше нiж у на z
#-  x < y;       вiдповiдь - у бiльше нiж х на z
#-  x == y.      вiдповiдь - х дорiвнює z

x = int(input())

y = int(input())

def our_function():
	if x > y:
		z = x - y
		print(x, 'бiльше нiж', y, 'на', z)
	if x < y:
		z = y - x	
		print(y, 'бiльше нiж', x, 'на', z)
	if x == y:
		z = y
		print(x, 'дорiвнює', z)

our_function()
