#Написати скрипт, який пройдеться по списку, який складається із кортежів, і замінить для кожного кортежа останнє значення.
#Список із кортежів можна захардкодити. Значення, на яке замінюється останній елемент кортежа вводиться користувачем.
#Значення, введене користувачем, можна ніяк не конвертувати (залишити рядком). 
#Кількість елементів в кортежу повинна бути різна.
#Приклад списка котежів: [(10, 20, 40), (40, 50, 60, 70), (80, 90), (1000,)]
#Очікуваний результат, якщо введено "100":
#Expected Output: [(10, 20, "100"), (40, 50, 60, "100"), (80, "100"), ("100",)]

my_list = [(10, 20, 23324, 40), (4023, 50, 60), (12, 123, 344,80, 90), (1000,)]

change_number = input("Write the number to change:")

new_list = [tpl[:-1] + (change_number,) for tpl in my_list]

print(new_list)





