#Написати скрипт, який залишить в словнику тільки пари із унікальними значеннями (дублікати значень - видалити). 
#Словник для роботи захардкодити свій.
 #               Приклад словника (не використовувати):
 #               {'a': 1, 'b': 3, 'c': 1, 'd': 5}
 #               Очікуваний результат:
 #               {'a': 1, 'b': 3, 'd': 5}

my_dict = {'a': 123, 'b': 2525, 'c':123, 'd':2626, 'e': 2525}

result = {}

for key,value in my_dict.items():

    if value not in result.values():

        result[key] = value

print(result)
